# ShowCircuitNumberOnOneRowForMultiphaseCircuits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..ShowCircuitNumberOnOneRowForMultiphaseCircuits Property
PanelScheduleData Class See Also
---
Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool ShowCircuitNumberOnOneRowForMultiphaseCircuits { get; set; }
```

Visual Basic
---
```text
Public Property ShowCircuitNumberOnOneRowForMultiphaseCircuits As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowCircuitNumberOnOneRowForMultiphaseCircuits {
	bool get ();
	void set (bool value);
}
```

# Remarks
Only applicable to two column formats
# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace